{"quotes":[
{"quote": "Don’t walk in front of me… I may not follow. Don’t walk behind me… I may not lead. Walk beside me… just be my friend.", "author": "Albert Camus", "tags": "friends"},
{"quote": "Good friends, good books, and a sleepy conscience: this is the ideal life.", "author": "Mark Twain", "tags": "friends"},
{"quote": "Outside of a dog, a book is man’s best friend. Inside of a dog it’s too dark to read.", "author": "Groucho Marx,", "tags": "friends"},
{"quote": "It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends.", "author": "J.K. Rowling,", "tags": "friends"},
{"quote": "There is no friend as loyal as a book.", "author": "Ernest Hemingway", "tags": "friends"},
{"quote": "It is one of the blessings of old friends that you can afford to be stupid with them.", "author": "Ralph Waldo Emerson,", "tags": "friends"},
{"quote": "Books are the quietest and most constant of friends; they are the most accessible and wisest of counselors, and the most patient of teachers.", "author": "Charles W. Eliot", "tags": "friends"},
{"quote": "I don’t know half of you half as well as I should like; and I like less than half of you half as well as you deserve.", "author": "J.R.R. Tolkien,", "tags": "friends"},
{"quote": "You’re going to come across people in your life who will say all the right words at all the right times. But in the end, it’s always their actions you should judge them by. It’s actions, not words, that matter.", "author": "Nicholas Sparks,", "tags": "friends"},
{"quote": "When you’re in jail, a good friend will be trying to bail you out. A best friend will be in the cell next to you saying, ’Damn, that was fun’.", "author": "Groucho Marx", "tags": "friends"},
{"quote": "I’m selfish, impatient and a little insecure. I make mistakes, I am out of control and at times hard to handle. But if you can’t handle me at my worst, then you sure as hell don’t deserve me at my best.", "author": "Marilyn Monroe", "tags": "life"},
{"quote":"You will become way less concerned with what other people think of you when you realize how seldom they do.","author":"David Foster Wallace","tags":"life"},
{"quote":"Five exclamation marks, the sure sign of an insane mind.","author":"Terry Pratchett","tags":"life"},
{"quote":"One friend with whom you have a lot in common is better than three with whom you struggle to find things to talk about.","author":"Mindy Kaling","tags":"friends"},
{"quote": "You know the world is going crazy when the best rapper is a white guy, the best golfer is a black guy, the tallest guy in the NBA is Chinese, the Swiss hold the America’s Cup, France is accusing the U.S. of arrogance, Germany doesn’t want to go to war, and the three most powerful men in America are named ’Bush’, ’Dick’, and ’Colin.’ Need I say more?", "author": "Chris Rock", "tags": "funny"},
{"quote": "Two things are infinite: the universe and human stupidity; and I’m not sure about the universe.", "author": "Albert Einstein", "tags": "science"},
{"quote": "Time and space and gravitation have no separate existence from matter.", "author": "Albert Einstein", "tags": "science"},
{"quote": "Spacetime tells matter how to move; matter tells spacetime how to curve.", "author": "John Archibald Wheeler", "tags": "science"},
{"quote": "Time is what prevents everything from happening at once.", "author": "John Archibald Wheeler", "tags": "science"},
{"quote": "In any field, find the strangest thing and then explore it.", "author": "John Archibald Wheeler", "tags": "science"},
{"quote": "I do not want people to be very agreeable, as it saves me the trouble of liking them a great deal.", "author": "Jane Austen,", "tags": "friends"},
{"quote": "A guy and a girl can be just friends, but at one point or another, they will fall for each other...Maybe temporarily, maybe at the wrong time, maybe too late, or maybe forever", "author": "Dave Matthews Band", "tags": "friends"},
{"quote": "I think if I’ve learned anything about friendship, it’s to hang in, stay connected, fight for them, and let them fight for you. Don’t walk away, don’t be distracted, don’t be too busy or tired, don’t take them for granted. Friends are part of the glue that holds life and faith together. Powerful stuff.", "author": "Jon Katz", "tags": "friends"},
{"quote": "Nobody likes being alone that much. I don’t go out of my way to make friends, that’s all. It just leads to disappointment. ", "author": "Haruki Murakami,", "tags": "friends"},
{"quote": "Do I not destroy my enemies when I make them my friends?", "author": "Abraham Lincoln", "tags": "friends"},
{"quote": "Some birds are not meant to be caged, that’s all. Their feathers are too bright, their songs too sweet and wild. So you let them go, or when you open the cage to feed them they somehow fly out past you. And the part of you that knows it was wrong to imprison them in the first place rejoices, but still, the place where you live is that much more drab and empty for their departure.", "author": "Stephen King,", "tags": "friends"},
{"quote": "If you have two friends in your lifetime, you’re lucky. If you have one good friend, you’re more than lucky.", "author": "S.E. Hinton", "tags": "friends"},
{"quote": "The man of knowledge must be able not only to love his enemies but also to hate his friends.", "author": "Friedrich Nietzsche", "tags": "friends"},
{"quote": "Must you go? I was rather hoping you’d stay and be a ministering angel, but if you must go, you must.", "author": "Cassandra Clare,", "tags": "friends"},
{"quote": "Animals are my friends...and I don’t eat my friends.", "author": "George Bernard Shaw", "tags": "friends"},
{"quote": "You’ve gotta dance like there’s nobody watching,", "author": "William W. Purkey", "tags": "life"},
{"quote": "You only live once, but if you do it right, once is enough.", "author": "Mae West", "tags": "life"},
{"quote": "In three words I can sum up everything I’ve learned about life: it goes on.", "author": "Robert Frost", "tags": "life"},
{"quote": "To live is the rarest thing in the world. Most people exist, that is all.", "author": "Oscar Wilde", "tags": "life"},
{"quote": "Insanity is doing the same thing, over and over again, but expecting different results.", "author": "Narcotics Anonymous", "tags": "life"},
{"quote": "It is better to be hated for what you are than to be loved for what you are not.", "author": "Andre Gide,", "tags": "life"},
{"quote": "There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle.", "author": "Albert Einstein", "tags": "life"},
{"quote": "Good friends, good books, and a sleepy conscience: this is the ideal life.", "author": "Mark Twain", "tags": "life"},
{"quote": "Life is what happens to us while we are making other plans.", "author": "Allen Saunders", "tags": "life"},
{"quote": "I may not have gone where I intended to go, but I think I have ended up where I needed to be.", "author": "Douglas Adams,", "tags": "life"},
{"quote": "Everything you can imagine is real.", "author": "Pablo Picasso", "tags": "life"},
{"quote": "Going to church doesn’t make you a Christian any more than going to a garage makes you an automobile.", "author": "Billy Sunday,", "tags": "funny"},
{"quote": "The planet is fine. The people are fucked.", "author": "George Carlin", "tags": "funny"},
{"quote": "Never go to bed mad. Stay up and fight.", "author": "Phyllis Diller", "tags": "funny"},
{"quote": "I did not attend his funeral, but I sent a nice letter saying I approved of it.", "author": "Mark Twain", "tags": "funny"},
{"quote": "Accept who you are. Unless you’re a serial killer.", "author": "Ellen DeGeneres,", "tags": "funny"},
{"quote": "It’s not true that I had nothing on. I had the radio on.", "author": "Marilyn Monroe", "tags": "funny"},
{"quote": "Everyone should be able to do one card trick, tell two jokes, and recite three poems, in case they are ever trapped in an elevator.", "author": "Lemony Snicket,", "tags": "funny"},
{"quote": "Once you can accept the universe as matter expanding into nothing that is something, wearing stripes with plaid comes easy.", "author": "Albert Einstein", "tags": "funny"},
{"quote": "When life gives you lemons, squirt someone in the eye.", "author": "Cathy Guiswite", "tags": "funny"},
{"quote": "If a book about failures doesn’t sell, is it a success?", "author": "Jerry Seinfeld", "tags": "funny"},
{"quote": "The saddest aspect of life right now is that science gathers knowledge faster than society gathers wisdom.", "author": "Isaac Asimov", "tags": "science"},
{"quote": "The Seven Social Sins are: 1.Wealth without work. 2.Pleasure without conscience. 3.Knowledge without character. 4.Commerce without morality. 5.Science without humanity. 6.Worship without sacrifice. 7.Politics without principle.", "author": "Frederick Lewis Donaldson", "tags": "science"},
{"quote": "Never memorize something that you can look up.", "author": "Albert Einstein", "tags": "science"},
{"quote": "Science without religion is lame, religion without science is blind.", "author": "Albert Einstein", "tags": "science"},
{"quote": "If we knew what it was we were doing, it would not be called research, would it?", "author": "Albert Einstein", "tags": "science"},
{"quote":"Most basic ideas of science are essentially simple and can usually be expressed in a language that everyone understands.","author":"Albert Einstein","tags":"science"},
{"quote": "One, remember to look up at the stars and not down at your feet. Two, never give up work. Work gives you meaning and purpose and life is empty without it. Three, if you are lucky enough to find love, remember it is there and don’t throw it away.", "author": "Stephen Hawking", "tags": "science"},
{"quote":"The usual approach of science of constructing a mathematical model cannot answer the questions of why there should be a universe for the model to describe. Why does the universe go to all the bother of existing?","author":"Stephen Hawking","tags":"science"},
{"quote": "Somewhere, something incredible is waiting to be known.", "author": "Carl Sagan", "tags": "science"},
{"quote": "The important thing is not to stop questioning. Curiosity has its own reason for existence. One cannot help but be in awe when he contemplates the mysteries of eternity, of life, of the marvelous structure of reality. It is enough if one tries merely to comprehend a little of this mystery each day.", "author": "Albert Einstein", "tags": "science"},
{"quote": "The fact that we live at the bottom of a deep gravity well, on the surface of a gas covered planet going around a nuclear fireball 90 million miles away and think this to be normal is obviously some indication of how skewed our perspective tends to be.", "author": "Douglas Adams", "tags": "science"},
{"quote": "The most beautiful experience we can have is the mysterious. It is the fundamental emotion that stands at the cradle of true art and true science.", "author": "Albert Einstein,", "tags": "science"},
{"quote": "Time is a drug. Too much of it kills you.", "author": "Terry Pratchett,", "tags": "science"},
{"quote": "We are just an advanced breed of monkeys on a minor planet of a very average star. But we can understand the Universe. That makes us something very special.", "author": "Stephen Hawking", "tags": "science"},
{"quote": "I’m sure the universe is full of intelligent life. It’s just been too intelligent to come here.", "author": "Arthur C. Clarke", "tags": "science"},
{"quote": "An expert is a person who has made all the mistakes that can be made in a very narrow field.", "author": "Niels Bohr", "tags": "science"},
{"quote": "A thinker sees his own actions as experiments and questions--as attempts to find out something. Success and failure are for him answers above all.", "author": "Friedrich Nietzsche","tags":"science"},
{"quote": "It would be possible to describe everything scientifically, but it would make no sense; it would be without meaning, as if you described a Beethoven symphony as a variation of wave pressure.", "author": "Albert Einstein","tags":"science"},
{"quote": "For me, it is far better to grasp the Universe as it really is than to persist in delusion, however satisfying and reassuring.", "author": "Carl Sagan,","tags":"science"},
{"quote": "I believe there is another world waiting for us. A better world. And I'll be waiting for you there.", "author": "David Mitchell,","tags":"science"},
{"quote": "Physics is like sex: sure, it may give some practical results, but that's not why we do it.", "author": "Richard P. Feynman","tags":"Physics"},
{"quote": "Extraordinary claims require extraordinary evidence.", "author": "Carl Sagan","tags":"science"},
{"quote": "I can see how it might be possible for a man to look down upon the earth and be an atheist, but I cannot conceive how a man could look up into the heavens and say there is no God.", "author": "Abraham Lincoln","tags":"science"},
{"quote": "Who is more humble? The scientist who looks at the universe with an open mind and accepts whatever the universe has to teach us, or somebody who says everything in this book must be considered the literal truth and never mind the fallibility of all the human beings involved?", "author": "Carl Sagan","tags":"science"},
{"quote": "Do you know what we call opinion in the absence of evidence? We call it prejudice.", "author": "Michael Crichton","tags":"science"},
{"quote": "If you try and take a cat apart to see how it works, the first thing you have on your hands is a non-working cat.", "author": "Douglas Adams","tags":"science"},
{"quote": "In science it often happens that scientists say, “You know that’s a really good argument; my position is mistaken,” and then they would actually change their minds and you never hear that old view from them again. They really do it. It doesn’t happen as often as it should, because scientists are human and change is sometimes painful. But it happens every day. I cannot recall the last time something like that happened in politics or religion.", "author": "Carl Sagan","tags":"science"},
{"quote": "Wisdom is not a product of schooling but of the lifelong attempt to acquire it.", "author": "Albert Einstein","tags":"science"},
{"quote": "God does not play dice with the universe.", "author":"Albert Einstein","tags":"science"},
{"quote": "Science investigates; religion interprets. Science gives man knowledge, which is power; religion gives man wisdom, which is control. Science deals mainly with facts; religion deals mainly with values. The two are not rivals.", "author": "Martin Luther King, Jr","tags":"science"},
{"quote": "The most incomprehensible thing about the world is that it is at all comprehensible.", "author": "Albert Einstein","tags":"science"},
{"quote": "I suppose it is tempting, if the only tool you have is a hammer, to treat everything as if it were a nail.", "author": "Abraham Maslow","tags":"science"},
{"quote": "Reading, after a certain age, diverts the mind too much from its creative pursuits. Any man who reads too much and uses his own brain too little falls into lazy habits of thinking.", "author": "Albert Einstein","tags":"science"},
{"quote": "We are stuck with technology when what we really want is just stuff that works.", "author": "Douglas Adams","tags":"science"},
{"quote": "I do not feel obliged to believe that the same God who has endowed us with sense, reason, and intellect has intended us to forgo their use.", "author": "Galileo Galilei","tags":"science"},
{"quote":"A misplaced decimal point will always end up where it will do the greatest damage.","author":"Anonymous","tags":"computers"},
{"quote":"Language shapes the way we think and determines what we can think about.","author":"Benjamin Whorf","tags":"language"},
{"quote":"A programming language that doesn’t change the way you think is not worth learning.","author":"Alan Perlis","tags":"computers"},
{"quote":"God is real, unless declared integer.","author":"Anonymous","tags":"funny"},
{"quote":"First, solve the problem. Then, write the code.","author":"John Johnson","tags":"computers"},
{"quote":"Experience is the name everyone gives to their mistakes.","author":"Oscar Wilde","tags":"life"},
{"quote":"Every piece of software written today is likely going to infringe on someone else’s patent.","author":"Miguel de Icaza","tags":"computers"},
{"quote":"Computers do not solve problems, they execute solutions.","author":"Anonymous","tags":"computers"},
{"quote":"I have NOT lost my mind — I have it backed up on tape somewhere.","author":"Anonymous","tags":"computers"},
{"quote":"Keyboard not found... Press any key to continue.","author":"BIOS v2.0","tags":"computers, funny"},
{"quote":"Microsoft is not the answer. Microsoft is the question. “No” is the answer.","author":"Anonymous","tags":"computers"},
{"quote":"Only half of programming is coding. The other 90% is debugging.","author":"Anonymous","tags":"computers"},
{"quote":"Pasting code from the Internet into production code is like chewing gum found in the street.","author":"Anonymous","tags":"computers"},
{"quote":"The best thing about a boolean is even if you are wrong, you are only off by a bit.","author":"Anonymous","tags":"computers, funny"},
{"quote":"There is no place like 127.0.0.1","author":"Anonymous","tags":"computers"},
{"quote":"Ubuntu is an ancient African word, meaning “can’t configure Debian”","author":"Anonymous","tags":"computers"},
{"quote":"UNIX is the answer, but only if you phrase the question very carefully.","author":"Anonymous","tags":"computers"},
{"quote":"You can stand on the shoulders of giants OR a big enough pile of dwarfs, works either way.","author":"Anonymous","tags":"funny"},
{"quote":"In order to be irreplaceable, one must always be different.","author":"Coco Chanel","tags":"life"},
{"quote":"Judge a man by his questions rather than by his answers.","author":"Voltaire","tags":"life"},
{"quote":"Measuring programming progress by lines of code is like measuring aircraft building progress by weight.","author":"Bill Gates","tags":"computers. life"},
{"quote":"On the Internet, nobody knows you’re a dog.","author":"Peter Steiner","tags":"life"},
{"quote":"One man’s constant is another man’s variable.","author":"Alan J. Perlis","tags":"computers"},
{"quote":"People that hate cats will come back as mice in their next life.","author":"Faith Resnick","tags":"life"},
{"quote":"Sometimes I think we’re alone in the universe & sometimes I think we’re not. In either case the idea is quite staggering","author":"Arthur C. Clarke","tags":"life"},
{"quote":"Talk is cheap, show me the code!","author":"Linus Torvalds","tags":"computers"},
{"quote":"They did not know it was impossible, so they did it!","author":"Mark Twain","tags":"life"},
{"quote":"You want it in one line? Does it have to fit in 80 columns?","author":"Larry Wall","tags":"computers"},
{"quote":"OO programming offers a sustainable way to write spaghetti code. It lets you accrete programs as a series of patches.","author":"Paul Graham","tags":"computers"},
{"quote":"If I had more time, I would have written a shorter letter.","author":"Cicero","tags":"computers"},
{"quote":"The best reaction to “this is confusing, where are the docs” is to rewrite the feature to make it less confusing, not write more docs.","author":"Jeff Atwood","tags":"computers"},
{"quote":"The older I get, the more I believe that the only way to become a better programmer is by not programming.","author":"Jeff Atwood","tags":"computers, life"},
{"quote":"You’re bound to be unhappy if you optimize everything.","author":"Donald E. Knuth","tags":"computers"},
{"quote":"If the programmers like each other, they play a game called “pair programming”. And if not then the game is called “peer review”.","author":"Anna Nachesa","tags":"computers"},
{"quote":"Focus on WHY instead of WHAT in your code will make you a better developer.","author":"Jordi Boggiano","tags":"computers"},
{"quote":"The best engineers I know are artists at heart. The best designers I know are secretly technicians as well.","author":"Andrei Herasimchuk","tags":"life"},
{"quote":"The proper use of comments is to compensate for our failure to express ourself in code.","author":"Robert C. Martin","tags":"computers"},
{"quote":"Code is like humor. When you have to explain it, it’s bad.","author":"Cory House","tags":"computers"},
{"quote":"Programmers are constantly making things more complicated than they need to be BECAUSE FUTURE. Fuck the future. Program for today.","author":"David Heinemeier Hansson","tags":"life"},
{"quote":"People will realize that software is not a product; you use it to build a product.","author":"Linus Torvalds","tags":"life"},
{"quote":"Code never lies, comments sometimes do.","author":"Ron Jeffries","tags":"computers"},
{"quote": "Two things you should know about me; The first is that I am deeply suspicious of people in general. It is my nature to expect the worst of them. And the second is that I am unexpectedly good with computers.", "author": "Veronica Roth", "tags": "computers"},
{"quote": "I think computer viruses should count as life ... I think it says something about human nature that the only form of life we have created so far is purely destructive. We’ve created life in our own image.", "author": "Stephen Hawking", "tags": "computers"},
{"quote": "The people who are crazy enough to think they can change the world are the ones who do.", "author": "Rob Siltanen", "tags": "computers"},
{"quote": "I know there’s a proverb which that says “To err is human,” but a human error is nothing to what a computer can do if it tries.", "author": "Agatha Christie,", "tags": "computers"},
{"quote": "Computers are like Old Testament gods; lots of rules and no mercy.", "author": "Joseph Campbell,", "tags": "computers"},
{"quote": "Don’t explain computers to laymen. Simpler to explain sex to a virgin.", "author": "Robert A. Heinlein,", "tags": "computers"},
{"quote": "Doing research on the Web is like using a library assembled piecemeal by pack rats and vandalized nightly. ", "author": "Roger Ebert", "tags": "computers"},
{"quote": "Those who can imagine anything, can create the impossible.", "author": "Alan Turing", "tags": "computers"},
{"quote": "No one messes around with a nerd’s computer and escapes unscathed.", "author": "E.A. Bucchianeri,", "tags": "computers"},
{"quote": "Idiots emit bogons, causing machinery to malfunction in their presence. System administrators absorb bogons, letting machinery work again.", "author": "Charles Stross,", "tags": "computers"},
{"quote": "It gives me strength to have somebody to fight for; I can never fight for myself, but, for others, I can kill.", "author": "Emilie Autumn,", "tags": "friends"},
{"quote": "Many people will walk in and out of your life, but only true friends will leave footprints in your heart", "author": "Eleanor Roosevelt", "tags": "friends"},
{"quote": "I am awfully greedy; I want everything from life. I want to be a woman and to be a man, to have many friends and to have loneliness, to work much and write good books, to travel and enjoy myself, to be selfish and to be unselfish… You see, it is difficult to get all which I want. And then when I do not succeed I get mad with anger.", "author": "Simone de Beauvoir", "tags": "friends"},
{"quote": "I got you to look after me, and you got me to look after you, and that’s", "author": "John Steinbeck,", "tags": "friends"},
{"quote": "True friends are always together in spirit.", "author": "L.M. Montgomery,", "tags": "friends"},
{"quote": "Sometimes the questions are complicated and the answers are simple.", "author": "Dr. Seuss", "tags": "life"},
{"quote": "Today you are You, that is truer than true. There is no one alive who is Youer than You.", "author": "Dr. Seuss,", "tags": "life"},
{"quote": "I’m not afraid of death; I just don’t want to be there when it happens.", "author": "Woody Allen", "tags": "life"},
{"quote": "Life isn’t about finding yourself. Life is about creating yourself.", "author": "George Bernard Shaw", "tags": "life"},
{"quote": "Life is like riding a bicycle. To keep your balance, you must keep moving.", "author": "Albert Einstein", "tags": "life"},
{"quote": "Reality continues to ruin my life.", "author": "Bill Watterson,", "tags": "life"},
{"quote": "Who are you to judge the life I live?", "author": "Bob Marley", "tags": "life"},
{"quote": "Things change. And friends leave. Life doesn’t stop for anybody.", "author": "Stephen Chbosky,", "tags": "life"},
{"quote": "The only way out of the labyrinth of suffering is to forgive.", "author": "John Green,", "tags": "life"},
{"quote": "When someone loves you, the way they talk about you is different. You feel safe and comfortable.", "author": "Jess C. Scott,", "tags": "life"},
{"quote": "He has achieved success who has lived well, laughed often, and loved much;", "author": "Bessie Anderson Stanley,", "tags": "life"},
{"quote": "I came from a real tough neighborhood. Once a guy pulled a knife on me. I knew he wasn’t a professional, the knife had butter on it.", "author": "Rodney Dangerfield", "tags": "funny"},
{"quote": "That’s why they call it the American Dream, because you have to be asleep to believe it.", "author": "George Carlin", "tags": "funny"},
{"quote": "Don’t be so humble - you are not that great.", "author": "Golda Meir", "tags": "funny"},
{"quote": "Always go to other people’s funerals, otherwise they won’t come to yours.", "author": "Yogi Berra,", "tags": "funny"},
{"quote": "A word to the wise ain’t necessary, it’s the stupid ones who need advice.", "author": "Bill Cosby", "tags": "funny"},
{"quote": "If you’re too open-minded; your brains will fall out.", "author": "Lawrence Ferlinghetti", "tags": "funny"},
{"quote": "I’ve been fighting to be who I am all my life. What’s the point of being who I am, if I can’t have the person who was worth all the fighting for?", "author": "Stephanie Lennox,", "tags": "funny"},
{"quote": "Science and religion are not at odds. Science is simply too young to understand.", "author": "Dan Brown,", "tags": "science"},
{"quote": "In the beginning there was nothing, which exploded.", "author": "Terry Pratchett,", "tags": "science"},
{"quote": "That which can be asserted without evidence, can be dismissed without evidence.", "author": "Christopher Hitchens", "tags": "science"},
{"quote": "Everything must be made as simple as possible. But not simpler.", "author": "Albert Einstein", "tags": "science"},
{"quote": "Though my soul may set in darkness, it will rise in perfect light; ", "author": "Sarah   Williams,", "tags": "science"},
{"quote": "A man who dares to waste one hour of time has not discovered the value of life.", "author": "Charles Darwin,", "tags": "science"},
{"quote": "The good thing about science is that it’s true whether or not you believe in it.", "author": "Neil deGrasse Tyson", "tags": "science"},
{"quote":"Only when creative people take ownership of cosmic discovery will society accept science as the cultural activity that it is.","author":"Neil deGrasse Tyson","tags":"science"},
{"quote": "Nothing in life is to be feared, it is only to be understood. Now is the time to understand more, so that we may fear less.", "author": "Marie Curie", "tags": "science"},
{"quote": "Science is not only compatible with spirituality; it is a profound source of spirituality.", "author": "Carl Sagan,", "tags": "science"},
{"quote": "For me, I am driven by two main philosophies: know more today about the world than I knew yesterday and lessen the suffering of others. You’d be surprised how far that gets you.", "author": "Neil deGrasse Tyson", "tags": "science"},
{"quote": "Your assumptions are your windows on the world. Scrub them off every once in a while, or the light won’t come in.", "author": "Isaac Asimov", "tags": "science"},
{"quote": "Space is big. You just won’t believe how vastly, hugely, mind-bogglingly big it is. I mean, you may think it’s a long way down the road to the chemist’s, but that’s just peanuts to space.", "author": "Douglas Adams,", "tags": "science"},
{"quote": "That’s the thing about people who think they hate computers. What they really hate is lousy programmers.", "author": "Larry Niven", "tags": "computers"},
{"quote": "There are 10 kinds of people in the world: those who understand binary numerals, and those who don’t.", "author": "Ian Stewart,", "tags": "computers"},
{"quote": "A computer lets you make more mistakes faster than any other invention with the possible exceptions of handguns and Tequila.", "author": "Mitch Ratcliffe", "tags": "computers"},
{"quote": "Whether we are based on carbon or on silicon makes no fundamental difference; we should each be treated with appropriate respect.", "author": "Arthur C. Clarke,", "tags": "computers"},
{"quote": "I am convinced that grandkids are inherently evil people who tell their grandparents to just go to the library and open up an e-mail account - it’s free and so simple.", "author": "Scott Douglas,", "tags": "computers"},
{"quote": "Computers don’t kill books; people do.", "author": "Douglas Rushkoff", "tags": "computers"},
{"quote": "I really didn’t foresee the Internet. But then, neither did the computer industry. Not that that tells us very much of course--the computer industry didn’t even foresee that the century was going to end.", "author": "Douglas Adams", "tags": "computers"},
{"quote": "Good judgement comes from experience, and experience comes from bad judgement.", "author": "Frederick P. Brooks", "tags": "computers"},
{"quote": "Computer Science is no more about computers than astronomy is about telescopes", "author": "Edsger Wybe Dijkstra", "tags": "computers"},
{"quote": "Emphasizing the crowd means de-emphasizing individual humans in the design of society, and when you ask people not to be people, they revert to bad, mob-like behaviors.", "author": "Jaron Lanier,", "tags": "computers"},
{"quote": "I am not the only person who uses his computer mainly for the purpose of diddling with his computer.", "author": "Dave Barry ", "tags": "computers"},
{"quote": "All of a sudden, we’ve lost a lot of control,’ he said. ‘We can’t turn off our internet; we can’t turn off our smartphones; we can’t turn off our computers. You used to ask a smart person a question. Now, who do you ask? It starts with g-o, and it’s not God…", "author": "Steve Wozniak", "tags": "computers"},
{"quote": "Finish each day and be done with it. You have done what you could. Some blunders and absurdities no doubt crept in; forget them as soon as you can. Tomorrow is a new day. You shall begin it serenely and with too high a spirit to be encumbered with your old nonsense.", "author": "Ralph Waldo Emerson", "tags": "life"},
{"quote": "I’m the one that’s got to die when it’s time for me to die, so let me live my life the way I want to.", "author": "Jimi Hendrix,", "tags": "life"},
{"quote": "If I have seen further it is by standing on the shoulders of Giants.", "author": "Isaac Newton,", "tags": "science"},
{"quote": "If you wish to make an apple pie from scratch, you must first invent the universe.", "author": "Carl Sagan,", "tags": "science"},
{"quote": "The fantastic advances in the field of electronic communication constitute a greater danger to the privacy of the individual.", "author": "Earl Warren", "tags": "computers"},
{"quote": "For most people, home we represented by four walls and a roof. Not for Noa. She preferred a motherboard to a mother, a keyboard to house keys. Nothing was more comforting than the hum of a spinning hard drive.", "author": "Michelle Gagnon,", "tags": "computers"},
{"quote":"Yes, reason has been a part of organized religion, ever since two nudists took dietary advice from a talking snake.","author":"Jon Stewart","tags":"funny"},
{"quote":"Religion. It's given people hope in a world torn apart by religion.","author":"Jon Stewart","tags":"life"},
{"quote":"I've been to Canada, and I've always gotten the impression that I could take the country over in about two days.","author":"Jon Stewart","tags":"funny"},
{"quote":"Yes, the long war on Christianity. I pray that one day we may live in an America where Christians can worship freely! In broad daylight! Openly wearing the symbols of their religion... perhaps around their necks? And maybe -- dare I dream it? -- maybe one day there can be an openly Christian President. Or, perhaps, 43 of them. Consecutively.","author":"Jon Stewart","tags":"life"},
{"quote":"I celebrated Thanksgiving in an old-fashioned way. I invited everyone in my neighborhood to my house, we had an enormous feast, and then I killed them and took their land.","author":"Jon Stewart","tags":"funny"},
{"quote":"If you don't stick to your values when they're being tested, they're not values: they're hobbies.","author":"Jon Stewart","tags":"funny"},
{"quote":"If 'con' is the opposite of pro, then isn't Congress the opposite of progress? Or did we just fucking blow your mind?!?","author":"Jon Stewart","tags":"funny"},
{"quote":"If America leads a blessed life, then why did God put all of our oil under people who hate us?","author":"Jon Stewart","tags":"funny"},
{"quote":"I’m not going to censor myself to comfort your ignorance.","author":"Jon Stewart","tags":"funny"},
{"quote":"I was born with an adult head and a tiny body. Like a ’Peanuts’ character.","author":"Jon Stewart","tags":"funny"},
{"quote":"Get there early because hope does not park your mother-fucking car.","author":"Jon Stewart","tags":"funny"},
{"quote":"Here’s how bizarre the war is that we’re in Iraq, and we should have known this right from the get-go: When we first went into Iraq, Germany didn’t want to go. Germany. The Michael Jordan of war took a pass.","author":"Jon Stewart","tags":"funny"},
{"quote":"Insomnia is my greatest inspiration.","author":"Jon Stewart","tags":"life"},
{"quote":"Thomas Jefferson once said: ’Of course the people don't want war. But the people can be brought to the bidding of their leader. All you have to do is tell them they're being attacked and denounce the pacifists for somehow a lack of patriotism and exposing the country to danger. It works the same in any country.’ I think that was Jefferson. Oh wait. That was Hermann Goering. Shoot.","author":"Jon Stewart","tags":"funny"},
{"quote":"It’s funny. When we were alive we spent much of our time staring up at the cosmos and wondering what was out there. We were obsessed with the moon and whether we could one day visit it. The day we finally walked on it was celebrated worldwide as perhaps man's greatest achievement. But it was while we were there, gathering rocks from the moon's desolate landscape, that we looked up and caught a glimpse of just how incredible our own planet was. Its singular astonishing beauty. We called her Mother Earth. Because she gave birth to us, and then we sucked her dry.","author":"Jon Stewart","tags":"funny"},
{"quote":"Religion is far more of a choice than homosexuality.","author":"Jon Stewart","tags":"life"},
{"quote":"By the way, when you finish the bottle of Crown Royal, you can still use the pouch to hold your broken dreams.","author":"Jon Stewart","tags":"funny"},
{"quote":"Most world religions denounced war as a barbaric waste of human life. We treasured the teachings of these religions so dearly that we frequently had to wage war in order to impose them on other people.","author":"Jon Stewart","tags":"life"},
{"quote":"Pigmentation was a quick and convenient way of judging a person. One of us, Dr. Martin Luther King, Jr., once proposed we instead judge people by the content of their character. He was shot.","author":"Jon Stewart","tags":"life"},
{"quote":"The internet is just a world passing notes around a classroom.","author":"Jon Stewart","tags":"computers"},
{"quote":"To the people who are upset about their hard-earned tax money going to things they don’t like: welcome to the f*cking club. Reimburse me for the Iraq war and oil subsidies, and diaphragms are on me!","author":"Jon Stewart","tags":"funny"},
{"quote":"We’ve come from the same history - 2000 years of persecution - we’ve just expressed our sufferings differently. Blacks developed the blues. Jews complained, we just never thought of putting it to music.","author":"Jon Stewart","tags":"funny"},
{"quote":"So, is there hope for a truly democratic Africa? Long answer: Only if continent-wide improvements in education, human rights and public health are coupled with an aggressive and far-sighted debt-relief program that breaks the cycle of subsistence farming and urban squalor. Short answer: No.","author":"Jon Stewart","tags":"life"},
{"quote":"Yesterday, the president met with a group he calls the coalition of the willing. Or, as the rest of the world calls them, Britain and Spain","author":"Jon Stewart","tags":"funny"},
{"quote":"Astronomy is perhaps the science whose discoveries owe least to chance, in which human understanding appears in its whole magnitude, and through which man can best learn how small he is.","author":"Georg Christoph Lichtenberg","tags":"Physics"},
{"quote":"It is possible in quantum mechanics to sneak quickly across a region which is illegal energetically.","author":"Richard P. Feynman","tags":"Physics"},
{"quote":"The centre of the system of the world is immovable.","author":"Sir Isaac Newton","tags":"Physics"},
{"quote":"The physicist in preparing for his work needs three things, mathematics, mathematics, and mathematics.","author":"Wilhelm Conrad Roentgen","tags":"Physics"},
{"quote":"Don’t compare yourself with anyone in this world... if you do so, you are insulting yourself.","author":"Bill Gates","tags":"life"},
{"quote":"鳶が鷹を生む、とんびがたかをうむ。\u000dEven plain parents can produce a genius child.","author":"Japanese prov.","tags":"life"},
{"quote":"能ある鷹は爪を隠す。\u000dA wise man keeps some of his talents in reserve.","author":"Japanese prov.","tags":"life"},
{"quote":"上手く行かないそんな日は上手な人に聞いてみよう。","author":"山脇豊","tags":"life"},
{"quote":"上手く行かないそんな日はすっきりさっぱりお片付け。","author":"山脇豊","tags":"life"},
{"quote":"上手く行かないそんな日は取り替えっこをしてみよう。","author":"山脇豊","tags":"life"},
{"quote":"上手く行かないそんな日は誰かの力を借りちゃおう。","author":"山脇豊","tags":"life"},
{"quote":"心がどきどきしちゃう日は大きく息して伸びをしよう。","author":"山脇豊","tags":"life"},
{"quote":"何にもやりたくない日は星の数ほど夢みよう。","author":"山脇豊","tags":"life"},
{"quote":"心がギクシャクしちゃう日は手紙に気持ちを書いてみよう。","author":"山脇豊","tags":"life"},
{"quote":"誰かを羨むそんな日は持ってる良さを見直そう。","author":"山脇豊","tags":"life"},
{"quote":"なんだか寂しいそんな日はみんなに合いに出掛けよう。","author":"山脇豊","tags":"life"},
{"quote":"上手く行かないそんな日も素敵な事が待ってるよ。","author":"山脇豊","tags":"life"},
{"quote":"Germans have a phrase: “Das ist nicht mein Bier.”, auf Englisch ist “That’s none of my business.”","author":"Anonymous","tags":"life"},
{"quote":"The Bible shows the way to go to heaven, not the way the heavens go.","author":"Galileo Galilei","tags":"life"},
{"quote":"Philosophy is written in that great book which ever lies before our eyes – I mean the universe.","author":"Galileo Galilei","tags":"science"},
{"quote":"Mathematics is the alphabet with which God has written the Universe.","author":"Galileo Galilei","tags":"science"},
{"quote":"A pessimist confronted with two bad choices, chooses both.","author":"Jewish Proverb","tags":"life"},
{"quote":"Sometimes it is not enough to have a good memory to have good memories.","author":"Chinese Proverb","tags":"life"},
{"quote":"Walking among three people, I find my teacher among them. I choose that which is good in them and follow it, and that which is bad and change it.","author":"Confucius","tags":"life"},
{"quote":"A small hole not mended in time will become a big hole much more difficult to mend.","author":"Chinese proverb","tags":"life"},
{"quote": "My turn. Kwyjibo. K-W-Y-J-I-B-O, 22 points, plus triple word score, plus 50 points for using all my letters. Game’s over, I’m outta here.","author":"Bart Simpson","tags":"The Simpsons"},
{"quote":"You know, Marge, that Bart is a little miracle -- his winning smile, his button nose, his fat little stomach, his face alight with wholesome mischief. He reminds me of me before the weight of the world crushed my spirit.","author":"Homer J. Simpson","tags":"The Simpsons"},
{"quote":"She’s wonderful! I could feel her sweet country soul in every digit clean encoded bit.","author":"Lisa Simpson","tags":"The Simpsons"},
{"quote":"Bart, the only reason to apologize is if you look deep down inside yourself and you find a spot, something you wish wasn’t there, because you feel bad you hurt your sister’s feelings.","author":"Lisa Simpson","tags":"The Simpsons"},
{"quote":"Country music sucks, all it does is take precious air space away from shock DJs whose cruelty and profanity amuse us all.","author":"Bart Simpson","tags":"The Simpsons"},
{"quote":"There are three sentences will get your through life: 1st, It was like that when I got there. 2nd, Oh, good idea boss!. 3rd, Cover for me!.","author":"Homer Simpson","tags":"The Simpsons"},
{"quote":"I don’t know who God is or where is he at, I just know that he is more powerful that Mom and Dad put together.","author":"Lisa Simpson","tags":"The Simpsons"},
{"quote":"About 10,000 muons reach every square meter of the earth's surface a minute; these charged particles form as by-products of cosmic rays colliding with molecules in the upper atmosphere. Traveling at relativistic speeds, muons can penetrate tens of meters into rocks and other matter before attenuating as a result of absorption or deflection by other atoms.","author":"Wolverton, Mark (Muons for peace)","tags":"science"},
{"quote":"It seems natural to modify the theory of Heisenberg and Fermi in the following way. The transition of a heavy particle from neutron state to proton state is not always accompanied by the emission of light particles. The transition is sometimes taken up by another heavy particle.","author":"Hideki Yukawa","tags":"science"},
{"quote":"Alzo mis ojos a tus cielos, miro la inmensa belleza de tus valles, selvas y monta\u0002nas. Sin embargo, hay algo que reclama mi alma y es el a\u0002norado regreso de nuestro Litoral cautivo.","author":"Anonymous","tags":"Bolivia"}
]
}
